flatiron-gossip-girls-backend/app/models/user.rb

    def celebrity_followers
        self.follows.map {|follow| follow.celebrity}
---
SELECT "celebrities".* FROM "celebrities"
SELECT "follows".* FROM "follows" WHERE "follows"."user_id" = ?  [["user_id", 1]]