flatiron-gossip-girls-backend/app/controllers/celebrities_controller.rb

SELECT "celebrities".* FROM "celebrities"
---
    def index
        @celebrities = Celebrity.all

SELECT "celebrities".* FROM "celebrities" WHERE "celebrities"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
    def show
        @celebrity = Celebrity.find(params[:id])