flatiron-gossip-girls-backend/app/controllers/follows_controller.rb

    def index
        @follows = Follow.all
---
SELECT "follows".* FROM "follows"

    def create
        #@follow = Follow.create!(follow_params)

        @user = User.find_by(id: follow_params[:user_id])
        @celebrity = Celebrity.find_by(id: follow_params[:celebrity_id])

        @follow = Follow.new(user_id: @user.id, celebrity_id: @celebrity.id)
        @follow.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "celebrities".* FROM "celebrities" WHERE "celebrities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "follows" ("user_id", "celebrity_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["celebrity_id", 1], ["created_at", "2020-07-30 14:01:41.644849"], ["updated_at", "2020-07-30 14:01:41.644849"]]

    def destroy
        @follow = Follow.find(params[:id])
        @follow.destroy!
---
SELECT "follows".* FROM "follows" WHERE "follows"."id" = ? LIMIT ?  [["id", 105], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 105]]