flatiron-gossip-girls-backend/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "shock" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["shock", 1], ["updated_at", "2020-07-29 20:13:41.110511"], ["id", 1]]
---
    def update
        @post = Post.find(params[:id])
        @post.update(post_params)